Repository: akimd/bison
Catalog: po/*.po
Languages: fr, ro, ru, tr

source: too many states (max %d)
fr: nombre trop grand d'états (max %d)
ru: слишком много состояний (максимально %d)
tr: çok fazla durum (en fazla %d)

source: Unknown system error
fr: Erreur système inconnue
ro: Eroare de sistem necunoscutã
ru: Неизвестная системная ошибка
tr: Bilinmeyen sistem hatasý

source: warning:
fr: AVERTISSEMENT:
ro: avertisment:
ru: предупреждение:
tr: uyarý:

source: fatal error:
fr: erreur fatale:
ro: eroare fatalã:
ru: фатальная ошибка:
tr: ölümcül hata:

source: Conflict in state %d between rule %d and token %s resolved as %s.
fr: Conflit à l'état %d entre la règle %d et le terminal %s résolu par %s.
ru: Конфликт в состоянии %d между правилом %d и лексемой %s разрешен как %s.
tr: %d durumu içinde %d kuralý ve %s andaçý arasýndaki çeliþki %s olarakçözümlendi.

source: reduce
fr: réduction
ru: вывод
tr: indirgeme

source: shift
fr: décalage
ru: сдвиг
tr: öteleme

source: an error
fr: une erreur
ru: ошибка
tr: bir hata

source: %d shift/reduce conflict
ru: %d конфликт сдвига/вывода

source: and
ru: и

source: %d reduce/reduce conflict
ru: %d конфликт вывода/вывода

source: State %d contains
ru: Состояние %d содержит

source: conflicts:
fr: conflits:
ru: конфликты:
tr: çeliþkiler:

source: %d shift/reduce
fr: %d décalage/réduction
ru: %d сдвиг/вывод
tr: %d öteleme/indirgeme

source: %d reduce/reduce
fr: %d réduction/réduction
ru: %d вывод/вывод
tr: %d indirgeme/indirgeme

source: %s contains
fr: %s contient
ru: %s содержит
tr: %s içerir

source: expected %d shift/reduce conflict
ru: ожидался %d конфликт сдвига/вывода

source: %-4s [reduce using rule %d (%s)]
fr: %-4s [réduction par la règle %d (%s)
ru: %-4s [вывод с использованием правила %d (%s)]
tr: %-4s [indirgeme kural %d (%s)'i kullanýyor]

source: $default reduce using rule %d (%s)
fr: $défaut réduction par la règle %d (%s)
ru: $default вывод с использованием правила %d (%s)
tr: $default indirgeme kural %d (%s)'i kullanýyor

source: %-4s reduce using rule %d (%s)
fr: %-4s réduction par la règle %d (%s)
ru: %-4s вывод с использованием правила %d (%s)
tr: %-4s indirgeme kural %d (%s)'i kullanýyor

source: $default reduce using rule %d (%s)
fr: $défaut réduction par la règle %d (%s)
ru: $default вывод с использованием правила %d (%s)
tr: $default indirgeme kural %d (%s)'i kullanýyor

source: cannot open file `%s'
fr: ne peut ouvrir le fichier `%s'
ro: nu am putut deschide fiºierul `%s'
ru: не удается открыть файл `%s'
tr: `%s' dosyasý açýlamadý

source: cannot close file
fr: ne peut fermer le fichier
ro: nu pot închide fiºierul
ru: не удается закрыть файл
tr: dosya kapatýlamýyor

source: GNU bison generates parsers for LALR(1) grammars.
fr: GNU bison génère des analyseurs pour les grammaires de type LALR(1).
ro: GNU bison genereazã parsere pentru gramatici LALR(1).
ru: GNU bison генерирует анализаторы для грамматик LALR(1).
tr: GNU bison LALR(1) gramerler için ayrýþtýrýcýlar üretir.

source: Usage: %s [OPTION]... FILE
fr: Usage: %s [OPTION]... FICHIER
ro: Folosire: %s [OPÞIUNE]... FIªIER
ru: Использование: %s [КЛЮЧИ]... ФАЙЛ
tr: Kullaným: %s [SEÇENEK]... DOSYA

source: If a long option shows an argument as mandatory, then it is mandatory for the equivalent short option also. Similarly for optional arguments.
fr: Si une option de forme longue montre un paramètre comme étant obligatoire, il est alors obligatoire également pour une option de forme courte. Il en est de même pour les paramètres optionnels.
ro: Dacã o opþiune lungã aratã un argument ca necesar, atunci el este necesar ºi pentru opþiunea scurtã echivalentã. Similar pentru argumentele opþionale.
ru: Если длинная форма ключа определяет аргумент как обязательный, то он также является обязательным для короткой формы. То же касается необязательных аргументов.
tr: Eðer bir uzun seçenek bir argümaný gerektirirse, bu gereklilik, denk olan kýsa seçenek için de geçerlidir. Bu durum, seçimli argümanlar için de geçerlidir.

source: Operation modes: -h, --help display this help and exit -V, --version output version information and exit -y, --yacc emulate POSIX yacc
fr: Modes d'utilisation: -h, --help afficher l'aide-mémoire -V, --version afficher le nom et la version du logiciel -y, --yacc émuler yacc en mode POSIX
ro: Moduri de operare: -h, --help afiºeazã acest mesaj ºi terminã -V, --version afiºeazã informaþii despre versiune ºi terminã -y, --yacc emuleazã POSIX yacc
ru: Режимы функционирования: -h, --help вывести эту справку и выйти -V, --version вывести информацию о версии и выйти -y, --yacc эмулировать POSIX yacc
tr: Çalýþma kipleri: -h, --help bu yardýmý göster ve çýk -V, --version sürüm bilgisini ver ve çýk -y, --yacc POSIX yacc öykünmesi

source: Parser: -S, --skeleton=FILE specify the skeleton to use -t, --debug instrument the parser for debugging --locations enable locations computation -p, --name-prefix=PREFIX prepend PREFIX to the external symbols -l, --no-lines don't generate `#line' directives -n, --no-parser generate the tables only -k, --token-table include a table of token names
fr: Analyseur: -S, --skeleton=FICHIER utiliser le FICHIER squelette -t, --debug activer le mode de mise au point de l'analyseur --locations permettre le calcul des localisations -p, --name-prefix=PREFIXE accoler le PREFIXE aux symboles externes -l, --no-lines ne pas générer les directives `#line' -n, --no-parser générer les tables seulement -r, --raw compter les jetons à partir de 3 -k, --token-table inclure la table des noms de jetons
ro: Parser: -S, --skeleton=FIªIER specificã scheletul de folosit -t, --debug instrumenteazã parserul pentru depanare --locations activeazã calculul locaþiilor -p, --name-prefix=PREFIX pune prefix PREFIX la simbolurile externe -l, --no-lines nu genera directive `#line' -n, --no-parser genereazã numai tabelele -k, --token-table include un tabel cu nume de elemente
ru: Анализатор: -S, --skeleton=ФАЙЛ указать файл шаблона -t, --debug настроить анализатор для отладки --locations включить вычисление местоположений -p, --name-prefix=ПРЕФИКС подставить ПРЕФИКС для внешних символов -l, --no-lines не генерировать директивы `#line' -n, --no-parser генерировать только таблицы -k, --token-table включить таблицу имен лексем
tr: Ayrýþtýrýcý: -S, --skeleton=DOSYA kullanýlacak iskeleti belirler -t, --debug ayrýþtýrýcý için hata ayýklayýcý aracý --locations konum hesaplamalarýný etkinleþtirir -p, --name-prefix=ÖNEK dýþ simgelere eklenen ÖNEK -l, --no-lines `#line' bildirimlerini üretmez -n, --no-parser sadece tablolarý üretir -k, --token-table andaç isimlerinin bir tablosunu içerir

source: Output: -d, --defines also produce a header file -v, --verbose also produce an explanation of the automaton -b, --file-prefix=PREFIX specify a PREFIX for output files -o, --output=FILE leave output to FILE -g, --graph also produce a VCG description of the automaton
ru: Вывод: -d, --defines создать также файл заголовков -v, --verbose создать также пояснения в автомату -b, --file-prefix=ПРЕФИКС указать ПРЕФИКС для выходных файлов -o, --output=ФАЙЛ поместить результат в ФАЙЛ -g, --graph создать также пояснения к автомату в виде VCG-графа

source: Report bugs to <bug-bison@gnu.org>.
fr: Rapporter toutes anomalies à <bug-bison@gnu.org>.
ro: Raportaþi bug-uri la <bug-bison@gnu.org>.
ru: Ошибки сообщайте по адресу <bug-bison@gnu.org>.
tr: Hatalarý <bug-bison@gnu.org>'a, çeviri hatalarýný <gnu-tr-u12a@lists.sourceforge.net>'e bildir.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
fr: Ce logiciel est libre; voir les sources pour les conditions de reproduction. AUCUNE garantie n'est donnée; tant pour des raisons COMMERCIALES que pour RÉPONDRE À UN BESOIN PARTICULIER.
ro: Acesta este software liber; vedeþi codul sursã pentru condiþii despre copiere. Nu existã nici o garanþie; nici chiar pentru COMERCIALIZARE sau de POTRIVIRE PENTRU UN SCOP ANUME.
ru: Это свободная программа; условия распространения смотрите в исходных текстах. НИКАКИХ гарантий не предоставляется, даже гарантии ПОЛЕЗНОСТИ или ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ.
tr: Bu bir serbest yazýlýmdýr; kopyalama koþullarý için kaynak koduna bakýnýz. Hiçbir garantisi yoktur; hatta SATILABÝLÝRLÝÐÝ veya HERHANGÝ BÝR AMACA UYGUNLUÐU için bile garanti verilmez.

source: `%s' is no longer supported
fr: `%s' n'est plus supporté
ru: `%s' больше не поддерживается
tr: `%s' artýk desteklenmiyor

source: Try `%s --help' for more information.
fr: Pour en savoir davantage, faites: `%s --help'.
ro: Încercaþi `%s --help' pentru informaþii suplimentare.
ru: Используйте `%s --help' для дополнительной информации.
tr: Daha fazla bilgi için `%s --help' yazýn.

source: %s: no grammar file given
fr: %s: grammaire manquante
ru: %s: не задан файл с грамматикой
tr: %s: gramer dosyasý verilmemiþ

source: %s: extra arguments ignored after `%s'
fr: %s: paramètres supplémentaires ignorés après `%s'
ru: %s: лишние аргументы после `%s' игнорированы
tr: %s: '%s' den sonraki argümanlar yoksayýldý

source: too many gotos (max %d)
fr: nombre trop grand de "goto" (Max %d)
ru: слишком много goto (максимально %d)
tr: gotos çok fazla (en fazla %d)

source: unexpected `/' found and ignored
fr: `/' inattendu et ignoré
ru: встречен и проигнорирован неожиданный символ `/'
tr: beklenmeyen `/' bulundu ve yoksayýldý

source: unterminated comment
fr: le commentaire ne se termine pas
ru: незаконченный комментарий
tr: sonlandýrýlmamýþ açýklama

source: unexpected end of file
fr: Fin de fichier inattendue
ru: неожиданный конец файла
tr: beklenmeyen dosya sonu

source: unescaped newline in constant
fr: retour de chariot sans échappement dans une constante
ru: неэкранированный перевод строки в константе
tr: sabit içinde kaçýþsýz yeni satýr

source: octal value outside range 0...255: `\%o'
fr: valeur octale à l'extérieur de l'intervalle 0...255: \%o
ru: восьмеричная величина за пределами диапазона 0...255: `\%o'
tr: sekizli deðer 0...255'in dýþýnda: `\%o'

source: hexadecimal value above 255: `\x%x'
fr: valeur hexadécimale supérieure à 255: \x%x
ru: шестнадцатеричная величина превышает 255: `\x%x'
tr: onaltýlýk deðer 255'in üstünde: `\x%x'

source: unknown escape sequence: `\' followed by `%s'
fr: séquence d'échappement inconnue: `\' suivie de `%s'
ru: неизвестная escape-последовательность: `%s' после `\'
tr: bilinmeyen kaçýþ sýrasý: `\' `%s' tarafýndan takip edildi

source: unterminated type name at end of file
fr: le nom de type ne se termine pas avant la fin de fichier
ru: незаконченное имя типа в конце файла
tr: dosya sonunda sonlandýrýlmamýþ tip adý

source: unterminated type name
fr: le nom de type ne se termine pas
ru: незаконченное имя типа
tr: sonlandýrýlmamýþ tip ismi

source: use "..." for multi-character literal tokens
fr: utilisez "..." pour les terminaux litéraux de plusieurs caractères
ru: используйте "..." для многосимвольных литеральных лексем
tr: çok-karakterli yazýn andaçlarý için "..." kullan

source: `%s' supports no argument: %s
ru: `%s' не поддерживает аргумента %s

source: `%s' requires an argument
ru: ключ `%s' должен использоваться с аргументом

source: maximum table size (%d) exceeded
fr: taille maximale de la table (%d) dépassée
ru: превышен максимальный размер таблицы (%d)
tr: en büyük tablo uzunluðu (%d) aþýldý

source: type %d is %s
fr: le type %d est %s
ro: tipul %d este %s
ru: тип %d является %s
tr: tip %d %s'dir

source: (rule %d)
fr: (règle %d)
ru: (правило %d)
tr: (kural %d)

source: $default accept
fr: $défaut accepter
ru: $default принятие
tr: $default onayla

source: NO ACTIONS
fr: PAS D'ACTION
ru: НЕТ ДЕЙСТВИЙ
tr: EYLEM YOK

source: $ go to state %d
ru: $ переход в состояние %d

source: %-4s shift, and go to state %d
fr: %-4s décalage et aller à l'état %d
ru: %-4s сдвиг, и переход в состояние %d
tr: %-4s ötele, ve durum %d'ye git

source: %-4s error (nonassociative)
fr: %-4s erreur (non-associatif)
ru: %-4s ошибка (неассоциативная)
tr: %-4s hata (birleþmeli deðil)

source: %-4s go to state %d
fr: %-4s aller à l'état %d
ru: %-4s переход в состояние %d
tr: %-4s durum %d'ye git

source: state %d
fr: état %d
ro: stare %d
ru: состояние %d
tr: durum %d

source: Grammar
fr: Grammaire
ro: Gramaticã
ru: Грамматика
tr: Gramer

source: Number, Line, Rule
ru: Номер, Строка, Правило

source: empty
ro: goleºte
ru: пусто

source: Terminals, with rules where they appear
fr: Terminaux, suivis des règles où ils apparaissent
ro: Terminale, cu reguli acolo unde acestea apar
ru: Терминальные символы с правилами, в которых они появляются
tr: Sabit simgeler, kurallarýnýn bulunduklarý yerde

source: Nonterminals, with rules where they appear
fr: Non-terminaux, suivis des règles où ils apparaissent
ro: Non-terminale, cu reguli acolo unde acestea apar
ru: Нетерминальные символы с правилами, в которых они появляются
tr: Deðiþken simgeler, kurallarýnýn bulunduklarý yerde

source: on left:
fr: à gauche:
ro: pe stânga:
ru: налево:
tr: solda:

source: on right:
fr: à droite:
ro: pe dreapta:
ru: направо:
tr: saðda:

source: %-4s error (nonassociative)
fr: %-4s erreur (non-associatif)
ru: %-4s ошибка (неассоциативная)
tr: %-4s hata (birleþmeli deðil)

source: $default reduce using rule %d (%s)
fr: $défaut réduction par la règle %d (%s)
ru: $default вывод с использованием правила %d (%s)
tr: $default indirgeme kural %d (%s)'i kullanýyor

source: Skipping to next \n
fr: Saut jusqu'au prochain \n
ru: Пропуск до следующего \n
tr: Sonrakine atlanýyor \n

source: Skipping to next %c
fr: Saut jusqu'au prochain %c
ru: Пропуск до следующего %c
tr: Sonraki %c'ye atlanýyor

source: invalid $ value
fr: la valeur de symbole $ n'est pas valide
ro: valoare $ invalidã
ru: неверное $ значение
tr: geçersiz $ deðeri

source: unterminated string at end of file
fr: chaîne de caractères non terminée en fin de fichier
ru: незаконченная строка в конце файла
tr: dosyanýn sonunda sonlandýrýlmamýþ dizge

source: unterminated string
fr: chaîne de caractère non terminée
ru: незаконченная строка
tr: sonlandýrýlmamýþ dizge

source: %s is invalid
fr: %s n'est pas valide
ru: неверный знак %s
tr: %s geçersizdir

source: $$ of `%s' has no declared type
fr: $$ de `%s' n'a pas son type déclaré
ro: $$ a lui `%s' nu are nici un tip declarat
ru: $$ в `%s' не имеет описанного типа
tr: `%s''in $$'ý bildirilmiþ tip deðil

source: $%d of `%s' has no declared type
fr: $%d de `%s' n'a pas de type déclaré
ro: $%d a lui `%s' nu are nici un tip declarat
ru: $%d из `%s' не имеет описанного типа
tr: `%d''in $%s'i bildirilmiþ tip deðil

source: unterminated `%{' definition
fr: La section de définition (%{) ne termine pas avant la fin du fichier
ru: незаконченное определение `%{'
tr: `%{' tanýmlamasý sonlandýrýlmamýþ

source: Premature EOF after %s
fr: Fin de fichier prématutée après %s
ru: Преждевременный конец файла после %s
tr: %s'den sonra erken EOF

source: symbol %s redefined
fr: symbole %s redéfini
ro: simbol %s redefinit
ru: повторное определение символа %s
tr: %s simgesi yeniden tanýmlandý

source: type redeclaration for %s
fr: redéclaration du type de %s
ro: redeclarare de tip pentru %s
ru: повторное описание типа для %s
tr: %s için yeniden tip bildirimi

source: `%s' is invalid in %s
fr: `%s' n'est pas valide dans %s
ru: `%s' неверно в %s
tr: `%s' %s içinde geçersizdir

source: multiple %s declarations
fr: multiples déclarations %s
ro: declaraþii %s multiple
ru: множественное описание %s
tr: çoklu %s bildirimleri

source: invalid %s declaration
fr: la déclaration %s n'est pas valide
ru: неверное описание %s
tr: geçersiz %s bildirimi

source: %type declaration has no <typename>
fr: la déclaration %type n'a pas de <nom_de_type>
ru: описание %type не имеет <имя_типа>
tr: %type bildirimi <tipadý>'na sahip deðil

source: invalid %%type declaration due to item: %s
fr: la déclaration %%type n'est pas valide en raison de l'item: %s
ru: неверное описание %%type из-за элемента: %s
tr: geçersiz %%type bildirimine neden olan öðe: %s

source: redefining precedence of %s
fr: redéfinition du niveau de priorité de %s
ro: precedenþã redefinitã pentru %s
ru: переопределение приоритета для %s
tr: %s'in önceliði tekrar tanýmlandý

source: invalid text (%s) - number should be after identifier
fr: le texte n'est pas valide (%s) - le nombre devrait suivre l'identificateur
ru: неверный текст (%s) - число должно следовать за идентификатором
tr: geçersiz metin (%s) - sayý tanýtýcýdan sonra olmalýdýr

source: unexpected item: %s
fr: item inattendu: %s
ru: неожиданный элемент: %s
tr: beklenmeyen öðe: %s

source: unmatched %s
fr: non appariement de %s
ru: непарная %s
tr: eþlenemeyen %s

source: argument of %%expect is not an integer
fr: le paramètre de %%expect n'est pas un entier
ru: аргумент %%expect не является целым числом
tr: %%expect'in argümaný bir tamsayý deðil

source: unrecognized item %s, expected an identifier
fr: item %s non reconnu, un identificateur est attendu
ru: нераспознанный элемент %s, ожидался идентификатор
tr: %s öðesi tanýnmadý, beklenen bir tanýtýcýdýr

source: expected string constant instead of %s
fr: chaîne de caractères constante attendue plutôt que %s
ru: вместо %s ожидалась строковая постоянная
tr: %s'in yerine sabit dizge beklendi

source: unrecognized: %s
fr: non reconnu: %s
ru: нераспознано: %s
tr: tanýnmayan: %s

source: no input grammar
fr: aucune grammaire en entrée
ru: нет входной грамматики
tr: girdi grameri yok

source: unknown character: %s
fr: caractère inconnu: %s
ru: неизвестный символ: %s
tr: bilinmeyen karakter: %s

source: unterminated %guard clause
fr: clause %guard non terminée
ru: незаконченный оператор %guard
tr: sonlandýrýlmamýþ %guard yantümcesi

source: ill-formed rule: initial symbol not followed by colon
fr: règle mal formée: le symbole initial n'est pas suivi de `:'
ru: неверное правило: двоеточие не следует за начальным символом
tr: kötü-biçemli kural: baþlangýç simgesini takip eden ":" yok

source: grammar starts with vertical bar
fr: la grammaire débute par une barre verticale
ru: грамматика начинается с вертикальной черты
tr: gramer düþey çubuk ile baþlýyor

source: rule given for %s, which is a token
fr: la règle pour %s, qui est un terminal
ro: regula datã pentru %s, care este un element (token)
ru: правило задано для %s, который является лексемой
tr: bir andaç olan %s için verilen kural

source: two @prec's in a row
fr: deux @prec de suite
ru: два @prec подряд
tr: bir satýrda iki @prec

source: %%guard present but %%semantic_parser not specified
fr: %%guard est présent mais %%semantic_parser n'est pas spécifié
ru: %%guard присутствует, а %%semantic_parser не задан
tr: %%guard sunulmuþ fakat %%semantic_parser belirlenmemiþ

source: two actions at end of one rule
fr: deux actions à la fin d'une même règle
ru: два действия в конце одного правила
tr: bir kuralýn sonunda iki eylem

source: type clash (`%s' `%s') on default action
fr: conflit de type (`%s' `%s') pour l'action par défaut
ru: конфликт типов (`%s' `%s') на действии по умолчанию
tr: öntanýmlý eylem üzerinde (`%s' `%s') tip çatýþmasý

source: empty rule for typed nonterminal, and no action
fr: règle vide pour une catégorie typée et aucune action
ro: regulã vidã pentru nonterminal cu tip, ºi nici o acþiune
ru: пустое правило для типизированного нетерминального символа, и нет действия
tr: Tipli deðiþken simge için boþ kural tanýmlanmýþ, ve eylembelirtilmemiþ

source: invalid input: %s
fr: entrée non valide: %s
ru: неверные входные данные: %s
tr: geçersiz girdi: %s

source: too many symbols (tokens plus nonterminals); maximum %d
fr: trop de symboles (jeton plus non terminaux); maximum %d
ru: слишком много символов (лексемы плюс нетерминалы); максимально %d
tr: çok fazla simge var (andaçlar ve deðiþken simgeler); en fazla %d

source: no rules in the input grammar
fr: la grammaire n'a pas de règles
ro: nici o regulã în gramatica furnizatã
ru: отсутствуют правила во входной грамматике
tr: girdi grameri içinde kurallar yok

source: symbol %s is used, but is not defined as a token and has no rules
fr: le symbole %s est utilisé mais ce n'est pas un terminal et il ne possède pas de règle
ro: simbolul %s e folosit, dar nu este definit ca element (token) ºi nu are nici o regulã
ru: символ %s используется, но не определен как лексема и не имеет правил
tr: simge %s kullanýldý, fakat bir andaç olarak tanýmlanmadý vekurallarý yok

source: tokens %s and %s both assigned number %d
fr: les jetons %s et %s se sont vus assigner le nombre %d
ro: ambelor elementele (tokens) %s ºi %s le sunt alocate acelaºi numãr %d
ru: обеим лексемам %s и %s присвоен номер %d
tr: %s ve %s andaçlarýnýn her ikisi %d sayýsýna atandý

source: conflicting precedences for %s and %s
fr: les priorités pour %s et %s entrent en conflit
ro: precedenþe în conflict pentru %s ºi %s
ru: противоречивые приоритеты для %s и %s
tr: %s ve %s için çeliþen öncelikler

source: conflicting assoc values for %s and %s
fr: les valeurs d'association de %s et %s entrent en conflit
ru: противоречивые значения ассоциативности для %s и %s
tr: %s ve %s için çeliþen birleþmeli deðerler

source: the start symbol %s is undefined
fr: le symbole de départ %s n'est pas défini
ro: simbolul de start %s nu este definit
ru: начальный символ %s неопределен
tr: baþlangýç simgesi %s tanýmlanmadý

source: the start symbol %s is a token
fr: le symbole de départ %s est un terminal
ro: simbolul de start %s este un element (token)
ru: начальный символ %s является лексемой
tr: baþlangýç simgesi %s bir andaçtýr

source: Useless nonterminals:
fr: Non-terminaux inutiles:
ru: Бесполезные нетерминалы:
tr: Yararsýz kurallar:

source: Terminals which are not used:
fr: Terminaux non utilisés:
ru: Неиспользованные терминалы:
tr: Kullanýlmayan sabit simgeler:

source: Useless rules:
fr: Règles inutiles:
ru: Бесполезные правила:
tr: Yararsýz kurallar:

source: %d rule never reduced
ro: %d regulã niciodatã redusã
ru: %d правило не сведено

source: %d useless nonterminal
ro: %d nonterminal fãrã rost
ru: %d бесполезный нетерминал

source: and
fr: et
ro: ºi
ru: и
tr: ve

source: %d useless rule
ro: %d regulã fãrã rost
ru: %d бесполезное правило

source: Start symbol %s does not derive any sentence
fr: Aucune phrase ne peut être dérivée du symbole de départ %s
ru: Начальный символ %s не выводит ни одного предложения
tr: Baþlangýç simgesi %s herhangi bir cümleden türemez

source: %s: option `%s' is ambiguous
fr: %s: l'option %s est ambigüe
ro: %s: opþiunea `%s' este ambiguã
ru: %s: неоднозначный ключ `%s'
tr: %s: `%s' seçeneði belirsiz

source: %s: option `--%s' doesn't allow an argument
fr: %s: l'option --%s n'admet pas de paramètre
ro: %s: opþiunea `--%s' nu permite un argument
ru: %s: ключ `--%s' должен использоваться без аргумента
tr: %s: `--%s' seçeneði argümansýz kullanýlýr

source: %s: option `%c%s' doesn't allow an argument
fr: %s: l'option %c%s n'admet pas de paramètre
ro: %s: opþiunea `%c%s' nu permite un argument
ru: %s: ключ `%c%s' должен использоваться без аргумента
tr: %s: seçenek `%c%s' argümansýz kullanýlýr

source: %s: option `%s' requires an argument
fr: %s: l'option %s requiert un paramètre
ro: %s: opþiunea `%s' necesitã un argument
ru: %s: ключ `%s' должен использоваться с аргументом
tr: %s: `%s' seçeneði bir argümanla kullanýlýr

source: %s: unrecognized option `--%s'
fr: %s: l'option --%s est inconnue
ro: %s: opþiune nerecunoscutã `--%s'
ru: %s: неизвестный ключ `--%s'
tr: %s: `--%s' seçeneði bilinmiyor

source: %s: unrecognized option `%c%s'
fr: %s: l'option %c%s est inconnue
ro: %s: opþiune nerecunoscutã `%c%s'
ru: %s: неизвестный ключ `%c%s'
tr: %s: `%c%s' seçeneði bilinmiyor

source: %s: illegal option -- %c
fr: %s: option illégale -- %c
ro: %s: opþiune ilegalã -- %c
ru: %s: недопустимый ключ -- %c
tr: %s: kuraldýþý seçenek -- %c

source: %s: invalid option -- %c
fr: %s: option non valide -- %c
ro: %s: opþiune ilegalã -- %c
ru: %s: неверный ключ -- %c
tr: %s: geçersiz seçenek -- %c
