Repository: akimd/bison
Catalog: po/*.po
Languages: fr, ro, ru, tr

source: %s: option requires an argument -- %c
fr: %s: l'option requiert un paramètre -- %c
ro: %s: opþiunea necesitã un argument -- %c
ru: %s: ключ должен использоваться с аргументом -- %c
tr: %s: seçenek bir argümanla kullanýlýr -- %c

source: %s: option `-W %s' is ambiguous
fr: %s: l'option `-W %s' est ambiguë
ro: %s: opþiunea `-W %s' este ambiguã
ru: %s: неоднозначный ключ `-W %s'
tr: %s: `-W %s' seçeneði belirsiz

source: %s: option `-W %s' doesn't allow an argument
fr: %s: l'option `-W %s' n'admet pas de paramètre
ro: %s: opþiunea `-W %s' nu permite un argument
ru: %s: ключ `-W %s' должен использоваться без аргумента
tr: %s: `-W %s' seçeneði argümansýz kullanýlýr

source: memory exhausted
fr: mémoire épuisée
ro: memorie epuizatã
ru: память исчерпана
tr: bellek tükendi

source: Conflict between rule %d and token %s resolved as shift
ro: Conflict între regula %d ºi elementul (token) %s rezolvat ca shift

source: Conflict between rule %d and token %s resolved as reduce
ro: Conflict între regula %d ºi elementul (token) %s rezolvat ca reduce

source: Conflict between rule %d and token %s resolved as an error
ro: Conflict între regula %d ºi elementul (token) %s rezolvat ca eroare

source: conflicts: %d shift/reduce, %d reduce/reduce
ro: conflicte: %d shift/reduce, %d reduce/reduce

source: conflicts: %d shift/reduce
ro: conflicte: %d shift/reduce

source: conflicts: %d reduce/reduce
ro: conflicte: %d reduce/reduce

source: State %d
ro: Stare %d

source: expected %d shift/reduce conflict
ro: am aºteptat %d conflict shift/reduce

source: expected 0 reduce/reduce conflicts
ro: am aºteptat 0 conflicte reduce/reduce

source: I/O error
ro: Eroare I/O

source: conflicting outputs to file %s
ro: ieºiri în conflict în fiºierul %s

source: Output: -d, --defines also produce a header file -r, --report=THINGS also produce details on the automaton -v, --verbose same as `--report=state' -b, --file-prefix=PREFIX specify a PREFIX for output files -o, --output=FILE leave output to FILE -g, --graph also produce a VCG description of the automaton
ro: Ieºire: -d, --defines creazã ºi un fiºier header -r, --report=LUCRURI creazã ºi detalii despre automaton -v, --verbose la fel ca `--report=state' -b, --file-prefix=PREFIX specificã un PREFIX pentru fiºierele ieºire -o, --output=FIªIER creazã ieºire în FIªIER -g, --graph creazã ºi o descriere VCG a automaton-ului

source: THINGS is a list of comma separated words that can include: `state' describe the states `itemset' complete the core item sets with their closure `lookahead' explicitly associate lookaheads to items `solved' describe shift/reduce conflicts solving `all' include all the above information `none' disable the report
ro: LUCRURI este o listã de cuvinte separate de virgulã ce pot fi: `state' descrie stãrile `itemset' completeazã seturile de elemente nucleu cu închiderea lor `lookahead' asociazã explicit lookaheads la elemente `solved' descrie rezolvarea conflictelor shift/reduce `all' include toatã informaþia de deasupra `none' deactiveazã raportarea

source: Written by Robert Corbett and Richard Stallman.
ro: Scris de Robert Corbett ºi Richard Stallman.

source: missing operand after `%s'
ro: operator lipsã dupã `%s'

source: extra operand `%s'
ro: extra operator `%s'

source: warning
ro: avertisment

source: rule never reduced because of conflicts
ro: regula nu este redusã niciodatã din cauza conflictelor

source: POSIX forbids declarations in the grammar
ro: POSIX interzice declaraþii în gramaticã

source: missing identifier in parameter declaration
ro: identificator lipsã în declaraþia parametrului

source: shift, and go to state %d
ro: shift, ºi mergi în starea %d

source: go to state %d
ro: mergi în starea %d

source: error (nonassociative)
ro: eroare (ne-asociativitate)

source: reduce using rule %d (%s)
ro: reduce folosind regula %d (%s)

source: $default
ro: $implicit

source: Rules never reduced
ro: Regulile nu au fost reduse

source: result type clash on merge function %s: <%s> != <%s>
ro: tipul rezultatului în conflict cu funcþia de combinare %s: <%s> != <%s>

source: type clash on default action: <%s> != <%s>
ro: conflict de tip pentru acþiunea implicitã: <%s> != <%s>

source: only one %s allowed per rule
ro: un singur %s permis pe fiecare regulã

source: %s affects only GLR parsers
ro: %s afecteazã numai parsere GLR

source: %s must be followed by positive number
ro: %s trebuie sã fie urmat de numere pozitive

source: useless rule
ro: regulã fãrã rost

source: useless nonterminal: %s
ro: nonterminal fãrã rost: %s

source: Useless nonterminals
ro: Nonterminale fãrã rost

source: Terminals which are not used
ro: Terminale care nu sunt folosite

source: Useless rules
ro: Reguli fãrã rost

source: start symbol %s does not derive any sentence
ro: simbol de start %s nu deriveazã nici o propoziþie

source: stray `,' treated as white space
ro: Virgulã `,' rãtãcitã tratatã ca spaþiu gol

source: invalid directive: %s
ro: directivã invalidã: %s

source: integer out of range: %s
ro: întreg în afara domeniului: %s

source: invalid character: %s
ro: caracter invalid: %s

source: invalid escape sequence: %s
ro: secvenþã escape invalidã: %s

source: unrecognized escape sequence: %s
ro: secvenþã escape nerecunoscutã: %s

source: missing `{' in `%s'
ro: `{' lipsã în `%s'

source: invalid value: %s
ro: valoare invalidã: %s

source: missing `%s' at end of file
ro: `%s' lipsã la sfârºitul fiºierului

source: %s redeclaration for %s
ro: redeclarare %s pentru %s

source: redefining user token number of %s
ro: numãrul elementului (token) definit de utilizator redefinit pentru %s

source: symbol `%s' used more than once as a literal string
fr: symbole `%s' utilisé plus d'une fois dans une chaîne litérale
ro: simbolul `%s' este folosit de mai multe ori ca ºir literar
tr: simge `%s' birden fazla defa sabit dizge olarak kullanýldý

source: symbol `%s' given more than one literal string
fr: symbole `%s' présent dans plus d'une chaîne litérale
ro: simbolului `%s' îi este dat mai mult de un singur ºir literar
tr: `%s' simgesine birden fazla sabit dizge verilmiþ

source: conflicting associativities for %s (%s) and %s (%s)
ro: asoaciativitãþi în conflict pentru %s (%s) ºi %s (%s)

source: invalid argument %s for %s
ro: argument invalid %s pentru %s

source: ambiguous argument %s for %s
ro: argument ambiguu %s pentru %s

source: Valid arguments are:
ro: Argumente valide sunt:

source: %u bitset_allocs, %u freed (%.2f%%).
ro: %u bitset_allocs, %u eliberate (%.2f%%).

source: %u bitset_sets, %u cached (%.2f%%)
ro: %u bitset_sets, %u stocate (cached) (%.2f%%)

source: %u bitset_resets, %u cached (%.2f%%)
ro: %u bitset_resets, %u stocate (cached) (%.2f%%)

source: %u bitset_tests, %u cached (%.2f%%)
ro: %u bitset_tests, %u stocate (cached) (%.2f%%)

source: count log histogram
ro: numãrã histograma jurnal

source: size log histogram
ro: dimensiune histogramã jurnal

source: density histogram
ro: densitate histogramã

source: Bitset statistics:
ro: Statistici bitset:

source: Accumulated runs = %u
ro: Rulãri acumulate = %u

source: Could not read stats file.
ro: Nu am putut citi fiºierul de statistici.

source: Bad stats file size.
ro: Dimensiune fiºier cu statistici incorectã.

source: Could not write stats file.
ro: Nu am putut scrie fiºier statistici.

source: Could not open stats file for writing.
ro: Nu am putut deschide fiºierul de statistici pentru scriere.

source: subsidiary program `%s' could not be invoked
ro: programul auxiliar `%s' nu poate fi invocat

source: subsidiary program `%s' not found
ro: programul auxiliar `%s' nu a fost gãsit

source: subsidiary program `%s' failed
ro: programul auxiliar `%s' a eºuat

source: subsidiary program `%s' failed (exit status %d)
ro: programul auxiliar `%s' a eºuat (stare de terminare %d)

source: Execution times (seconds)
ro: Timp de execuþie (secunde)

source: time in %s: %ld.%06ld (%ld%%)
ro: timp în %s: %ld.%06ld (%ld%%)

source: Copyright 1984, 1986, 1989, 1992, 2000, 2001 Free Software Foundation, Inc.
tr: Telifhakký 1984, 1986, 1989, 1992, 2000, 2001 Free Software Foundation, Inc.
